Repository: carlisson/nh1
Catalog: lib/locale/*.po
Languages: pt_br

source: Get a specific line from a text file
pt_br: Pega uma linha específica de um arquivo de texto

source: Generate a secure password
pt_br: Gera uma senha segura

source: Make a booklet form a PDF file
pt_br: Faz um livreto a partir de um arquivo PDF

source: Compress a PDF file
pt_br: Comprime um arquivo PDF

source: Generates a favicon from a PNG file
pt_br: Gera um favicon a partir de um arquivo PNG

source: Run one pomodoro (default is %s min)
pt_br: Roda um pomodoro (default é %s min)

source: Print percentage for battery (notebook)
pt_br: Mostra a porcentagem da bateria (notebook)

source: Remove a substring from a string
pt_br: Remove uma substring de uma string

source: Replace a substring inside a string
pt_br: Substitui uma substring dentro de uma string

source: Counter 30-30-30 to router reset
pt_br: Contador 30-30-30 para reset de roteador

source: Returns a random special character
pt_br: Retorna um caractere especial aleatório

source: Makes a temporary file, directory or name
pt_br: Cria um arquivo, diretório ou nome demporário

source: Countdown timer.
pt_br: Temporizador regressivo.

source: Shows a random tip
pt_br: Mostra uma dica aleatória

source: Translate char supporting unicode
pt_br: Traduz caractere suportando unicode

source: Duration of a Pomodoro (%s). Default: %s min.
pt_br: Duração de um Pomodoro (%s). Default: %s minutos.

source: Path for tip groups (text files).
pt_br: Caminho para os grupos de dicas (arquivos de texto).

source: Usage: %s [%s] [%s]
pt_br: Uso: %s [%s] [%s]

source: previous date or timestamp
pt_br: data anterior ou timestamp

source: Abbreviate [1]? 0:yes;1:no
pt_br: Abreviar [1]? 0:sim;1:não

source: text file
pt_br: arquivo de texto

source: line number
pt_br: número da linha

source: PDF file
pt_br: arquivo PDF

source: %s or %s. Default is %s
pt_br: %s ou %s. Default é %s.

source: PNG file
pt_br: arquivo PNG

source: Favicon output file (optional)
pt_br: arquivo favicon de saída (opcional)

source: text to remove or start
pt_br: texto para remover ou início

source: end of interval to remove
pt_br: fim do intervalo para remover

source: Full text in stdin
pt_br: Texto inteiro na entrada padrão

source: Usage: | %s [%s] [%s]
pt_br: Uso: | %s [%s] [%s]

source: old text
pt_br: texto anterior

source: new text
pt_br: texto novo

source: mode. Default: name
pt_br: modo. Default: name

source: extension (optional)
pt_br: extensão (opcional)

source: Operation mode
pt_br: Modo de operação

source: only creates a name/path
pt_br: só cria um nome/caminho

source: creates a file
pt_br: cria um arquivo

source: creates a directory
pt_br: cria um diretório

source: creates a file in current directory
pt_br: cria um arquivo no diretório atual

source: Extension
pt_br: Extensão

source: Suffix, starting with a dot (.)
pt_br: Sufixo, começando com um ponto (.)

source: chars to find
pt_br: caracteres a buscar

source: chars to replace
pt_br: caracteres a substituir

source: Words %s %s; special %s; morphs: %s %s.
pt_br: Palavras %s %s; especial %s; transformações %s %s.

source: Usage:
pt_br: Uso:

source: Available timers
pt_br: Temporizadores disponíveis

source: finished
pt_br: concluído

source: 30-30-30 method for router reseting
pt_br: Método 30-30-30 para resetar um roteador

source: your router will lost all configuration
pt_br: seu roteador perderá toda a configuração

source: Turn on the router.
pt_br: Ligue o roteador.

source: Press and hold reset button. Wait 30 seconds.
pt_br: Pressione e segure o botão reset. Espere 30 segundos.

source: Turn off the router. Wait 30 seconds.
pt_br: Desligue o roteador. Espere 30 segundos.

source: Turn on the router. Wait 30 seconds.
pt_br: Ligue o roteador. Espere 30 segundos.

source: Release the button
pt_br: Solte o botão

source: Press ENTER when you are ready.
pt_br: Pressione ENTER quando estiver pronto.

source: Router on
pt_br: Roteador ligado

source: Router off
pt_br: Roteador desligado

source: Your router must be restarted with factory settings!
pt_br: Seu roteador deve estar resetado com a configuração de fábrica!

source: Tip groups: %s.
pt_br: Grupos de dicas: %s.

source: No tips group %s found.
pt_br: Nenhum grupo de dica com o nome %s.

source: Input file %s with %i pages, output %s. Sequence: %s Temp file: %s.
pt_br: Arquivo de entrada %s com %i páginas, saída %s. Sequência: %s. Arquivo temporário: %s.

source: +1y
pt_br: +1a

source: %s years
pt_br: %s anos

source: %s year
pt_br: %s ano

source: %sw
pt_br: %ssem

source: %s weeks
pt_br: %s semanas

source: %s week
pt_br: %s semana

source: %s days
pt_br: %s dias

source: %s day
pt_br: %s dia

source: %s hours
pt_br: %s horas

source: %s hour
pt_br: %s hora

source: %s minutes
pt_br: %s minutos

source: %s minute
pt_br: %s minuto

source: %s seconds
pt_br: %s segundos

source: %s second
pt_br: %s segundo

source: %s, %s, %s, %s, %s and %s
pt_br: %s, %s, %s, %s, %s e %s

source: %s, %s, %s, %s and %s
pt_br: %s, %s, %s, %s e %s

source: %s, %s, %s and %s
pt_br: %s, %s, %s e %s

source: %s, %s and %s
pt_br: %s, %s e %s

source: %s and %s
pt_br: %s e %s

source: Morph Section (strings)
pt_br: Seção Morph (textos)

source: String transformation utilities
pt_br: Utilitários para transformação de texto

source: Transform a string
pt_br: Tranforma um texto

source: Converts integer to words
pt_br: Converte inteiro em palavras

source: transformation
pt_br: transformação

source: Available transformations: %s.
pt_br: Transformações disponíveis: %s.

source: You can apply more transformations using comma (ex: %s)
pt_br: Você pode aplicar mais tranformações usando vírgula (ex: %s)

source: Usage: %s [%s]
pt_br: Uso: %s [%s]

source: number
pt_br: número

source: one
pt_br: um

source: two
pt_br: dois

source: three
pt_br: três

source: four
pt_br: quatro

source: five
pt_br: cinco

source: six
pt_br: seis

source: seven
pt_br: sete

source: eight
pt_br: oito

source: nine
pt_br: nove

source: ten
pt_br: dez

source: eleven
pt_br: onze

source: twelve
pt_br: doze

source: thirteen
pt_br: treze

source: fourteen
pt_br: catorze

source: fiveteen
pt_br: quinze

source: sixteen
pt_br: dezesseis

source: seventeen
pt_br: dezessete

source: eighteen
pt_br: dezoito

source: nineteen
pt_br: dezenove

source: twenty
pt_br: vinte

source: thirty
pt_br: trinta

source: forty
pt_br: quarenta

source: fifty
pt_br: cinquenta

source: sixty
pt_br: sessenta

source: seventy
pt_br: setenta

source: eighty
pt_br: oitenta

source: ninety
pt_br: noventa

source: twenty-%s
pt_br: vinte e %s

source: thirty-%s
pt_br: trinta e %s

source: forty-%s
pt_br: quarenta e %s

source: fifty-%s
pt_br: cinquenta e %s

source: sixty-%s
pt_br: sessenta e %s

source: seventy-%s
pt_br: setenta e %s

source: eighty-%s
pt_br: oitenta e %s

source: ninety-%s
pt_br: noventa e %s

source: one hundred
pt_br: cem

source: two hundred
pt_br: duzentos

source: three hundred
pt_br: trezentos

source: four hundred
pt_br: quatrocentos

source: five hundred
pt_br: quinhentos

source: six hundred
pt_br: seiscentos

source: seven hundred
pt_br: setecentos

source: eight hundred
pt_br: oitocentos

source: nine hundred
pt_br: novecentos

source: one hundred and %s
pt_br: cento e %s

source: two hundred and %s
pt_br: duzentos e %s

source: three hundred and %s
pt_br: trezentos e %s

source: four hundred and %s
pt_br: quatrocentos e %s

source: five hundred and %s
pt_br: quinhentos e %s

source: six hundred and %s
pt_br: seiscentos e %s

source: seven hundred and %s
pt_br: setecentos e %s

source: eight hundred and %s
pt_br: oitocentos e %s

source: nine hundred and %s
pt_br: novecentos e %s

source: one thousand
pt_br: cem

source: many
pt_br: muitos

source: Argument is not an integer number.
pt_br: O parâmetro não é um número inteiro.

source: Network
pt_br: Redes

source: Returns all hosts in all your networks
pt_br: Retorna todos os hosts de todas as suas redes

source: Check status for every host in a internal .hosts
pt_br: Checa status para cada host em um arquivo interno .hosts

source: Returns baudrate for a number from 1 to 13
pt_br: Returna baudrate para um número entre 1 e 13

source: Start download(s)
pt_br: Inicia download(s)

source: Add URL to download later
pt_br: Adiciona URL para baixar depois

source: Reset download queue
pt_br: Reseta a fila de downloads

source: Download favicon from URL
pt_br: Baixa favicon a partir de uma URL

source: List download planning
pt_br: Lista planejamento de downloads

source: Delete URL from list to download
pt_br: Deleta URL da lista de downloads

source: Search in all network every IP with given port open
pt_br: Busca em toda a rede os IPs com certa porta aberta

source: Return a valid ping-available IP for some host or domain name
pt_br: Retorna um IP válido para algum host ou domínio

source: Lists all hosts in given group
pt_br: Lista todos os hosts em um dado grupo

source: Create or update a host entry
pt_br: Cria ou atualiza uma entrada de host

source: Removes a host entry
pt_br: Remove uma entrada de host

source: Imports hosts from DHCPD
pt_br: Importa hosts do DHCPD

source: Migrates a host to another group
pt_br: Migra um host para outro grupo

source: Return HTTP status for given URL
pt_br: Retorna status HTTP para uma URL

source: List network interfaces
pt_br: Lista as interfaces de rede

source: Run iperf connecting to a 1iperfd IP
pt_br: Roda iperf conectando-se a um IP 1iperfd

source: Run iperfd, waiting for 1iperf connection
pt_br: Roda iperfd, aguardando uma conexão do 1iperf

source: Return if a given string is an IP address
pt_br: Returna se um texto é um endereço IP

source: Return if server is on. Params: (-q for quiet or name), IP
pt_br: Retorna se o servidor está ligado. Parâmetros: (-1 para quieto ou nome), IP

source: Return prefixes for a given vendor
pt_br: Retorna prefixos para um dado fabricante

source: Return all networks running on network interfaces
pt_br: Retorna todas as redes rodando nas interfaces de rede

source: Scan if given port(s) for a given host is/are open
pt_br: Busca se dada porta (ou portas) para certo host está/estão aberta(s)

source: Connect to a serial port
pt_br: Conecta a uma porta serial

source: Connect a SSH server (working with eXtreme)
pt_br: Conecta a um servidor SSH (funciona com eXtreme)

source: Run tcpdump in a given network interface
pt_br: Roda tcpdump em uma dada interface de rede

source: Connect a Telnet server
pt_br: Conecta a um servidor Telnet

source: Backup configuration of one or more extreme switchs
pt_br: Salva a configuração de um ou mais switch(s) eXtreme

source: List all VLANs in given eXtreme switch
pt_br: Lista todas as VLANs em um dado switch eXtreme

source: Path for network (hosts and groups) files.
pt_br: Caminho para os arquivos de rede (hosts e grupos).

source: Timeout for check functions.
pt_br: Tempo limite para funções de checagem.

source: Server port. Default: %s.
pt_br: Porta do servidor. Default: %s.

source: Path where save downloads when using 1get.
pt_br: Caminho onde downloads são salvos quando usando 1get.

source: Output file
pt_br: Arquivo de saída

source: Usage: %s %s
pt_br: Uso: %s %s

source: New host group name
pt_br: Nome do novo grupo de hosts

source: Bauds possible:
pt_br: Bauds possíveis:

source: You need to give a string to test if it is an IP address.
pt_br: Você precisa passar um texto para testar se ele é um endereço IP.

source: %s is unkown or unavailable.
pt_br: %s desconhecido ou indisponível.

source: You need to put a machine name
pt_br: Você precisa passar um nome de máquina

source: Available groups
pt_br: Grupos disponíveis

source: Host or group not found.
pt_br: Host ou grupo não encontrado.

source: Trying to connect %s (%s) with iperf.
pt_br: Tentando conectar %s (%s) com iperf.

source: You need to put a IP address where 1iperfd is running.
pt_br: Você precisa passar um endereço IP onde 1iperfd esteja rodando.

source: IP %s returned for machine %s.
pt_br: IP %s respondeu (máquina %s).

source: %s is active
pt_br: %s está ativo

source: %s not found
pt_br: %s não encontrado.

source: SSH is not available. Trying to connect via Telnet.
pt_br: SSH não está disponível. Tentando conectar via Telnet.

source: Telnet is not available. You can access this IP in your browser: %s://%s.
pt_br: Telnet não está disponível. Você pode acessar este IP pelo seu navegador: %s://%s.

source: Cannot connect %s.
pt_br: Não consegui conectar com %s.

source: Trying to connect using cipher %s and host-key %s
pt_br: Tentando conectar usando cipher %s e host-key %s

source: Connecting via %s.
pt_br: Conectando via %s.

source: Trying connect in simple mode
pt_br: Tentando conectar em modo simples

source: Cannot connect with %s using SSH.
pt_br: Não consegui conectar com %s usando SSH.

source: %s is on
pt_br: %s está ligada

source: Host not found.
pt_br: Host não encontrado.

source: %s open
pt_br: %s aberta

source: %s refused
pt_br: %s recusada

source: trying %s:%s
pt_br: tentando %s:%s

source: %i hosts with port %i open.
pt_br: %i hosts com porta %i aberta.

source: group
pt_br: grupo

source: every host in all groups
pt_br: todo host em todos os grupos

source: Unknown group of hosts.
pt_br: Grupo de hosts desconhecido.

source: You can use hostnames contained in .hosts
pt_br: Você pode usar hostnames contidos em .hosts

source: VLANs in SWITCH! Please inform password for %s.
pt_br: VLANs no Switch! Por favor, informe senha para %s.

source: Serial program not found. Checked
pt_br: Programa serial não encontrado.

source: No ttyUSB found.
pt_br: Nenhuma porta ttyUSB foi encontrada.

source: Doing backup of %s to %s
pt_br: Fazendo backup de %s para %s

source: Downloading %s
pt_br: Baixando %s

source: Usage: 1get [%s]
pt_br: Uso: 1get [%s].

source: URL is optional. 1get starts download of every URL in queue.
pt_br: URL é opcional. 1get inicia o download de todas as URL na fila.

source: Download of %s successful.
pt_br: Download de %s bem-sucedido.

source: Error downloading %s.
pt_br: Erro baixando %s.

source: Download Queue
pt_br: Fila de Downloads

source: Download queue is empty.
pt_br: A fila de downloads está vazia.

source: DHCPD file not found. Are you in a network server?
pt_br: Arquivo DHCPD não encontrado. Você está em um servidor de rede?

source: A network group with name %s already exists.
pt_br: Um grupo de rede com nome %s já existe.

source: Roll a single dice from N faces (default: 6)
pt_br: Role um dado simples de N lados (default: 6)

source: Roll dices with RPG formula: 2d10, 1d4+1...
pt_br: Role dados com fórmula de RPG: 2d10, 1d4+1...

source: Roll one d4 dice
pt_br: Role um dado d4

source: Roll one d6 dice
pt_br: Role um dado d6

source: Roll one d8 dice
pt_br: Rolde um dado d8

source: Roll one d10 dice
pt_br: Role um dado d10

source: Roll one d12 dice
pt_br: Role um dado d12

source: Roll one d20 dice
pt_br: Role um dado d20

source: Roll one d100 dice
pt_br: Role um dado d100

source: Sort a random playing card
pt_br: Sorteie uma carta de baralho

source: Draw an item from a list
pt_br: Sorteia um ítem de uma lista

source: List groups to draw-functions
pt_br: Lista grupos para funções de sorteio

source: Add a new group to draw-functions
pt_br: Adiciona um novo grupo às funções de sorteio

source: Delete a group from draw-functions
pt_br: Deleta um grupo das funções de sorteio

source: Path for draw-lists (RPG).
pt_br: Caminho para os grupos de sorteio (RPG).

source: Params
pt_br: Parâmetros

source: Examples
pt_br: Exemplos

source: Joker
pt_br: Coringa

source: Ace
pt_br: Ás

source: Jack
pt_br: Valete

source: Queen
pt_br: Rainha

source: King
pt_br: Rei

source: Clubs
pt_br: Paus

source: Diamonds
pt_br: Ouros

source: Hearts
pt_br: Copas

source: Spades
pt_br: Espadas

source: %s of %s
pt_br: %s de %s

source: No group found.
pt_br: Nenhum grupo encontrado.

source: Groups: %s.
pt_br: Grupos: %s.

source: File not found for group %s.
pt_br: Arquivo não encontrado para o grupo %s.

source: Group %s not found.
pt_br: Grupo %s não encontrado.

source: User interface for simple user interaction
pt_br: Interface de usuário para interação simples

source: GUI level. 0: none; 1: console only; 2: including GUI (default)
pt_br: Nível da interface. 0: sem; 1: só console; 2: inclui GUI (default)

source: ask a question and receive user entry
pt_br: faz uma pergunta e recebe a entrada do usuário

source: ask user for confirmation
pt_br: pede confirmação ao usuário

source: show a menu of options
pt_br: mostra um menu de opções

source: show a message to user
pt_br: mostra uma mensagem ao usuário

source: 1ui will work with %s.
pt_br: 1ui funcionará com %s.

source: Enter the number of your choice
pt_br: Entre com o número da sua escolha

source: Option
pt_br: Opção

source: Value validators
pt_br: Validadores de valor

source: option or validation
pt_br: Opção ou validação

source: Validations and options
pt_br: Validações e opções

source: Brazilian civic card number
pt_br: CPF brasileiro (registro civil)

source: E-mail address
pt_br: Endereço de email

source: Person name
pt_br: Nome da pessoa

source: Static linktree and hotsite generator
pt_br: Gerador de hotsites e linktrees estáticos

source: Hierarchical note taking
pt_br: Anotações hierárquicas

source: Security-first diagramming for teams
pt_br: Diagramas para equipes, com segurança

source: Diceware D12 password generator
pt_br: Gerador de senhas Diceware D12

source: Get Things Done with Privacity
pt_br: Use GTD com Privacidade

source: Mozilla Firefox web browser
pt_br: Navegador web Mozilla Firefox

source: Client for Youtube
pt_br: Cliente para Youtube

source: A set of utilities for shell
pt_br: Conjunto de utilitários shell

source: Cross-platform language and toolkit
pt_br: Linguagem e toolkit cross-platform

source: Simple GUI diary
pt_br: Diário GUI simples

source: Code editor for KDE
pt_br: Editor de código para KDE

source: Password manager
pt_br: Gerenciador de senhas

source: Web Browser
pt_br: Navegador Web

source: Open source tool for writers
pt_br: Ferramenta aberta para escritores

source: Markdown editor
pt_br: Editor de Markdown

source: A customizable Matrix chat client
pt_br: Um cliente de chat Matrix customizável

source: Client for Nextcloud desktop
pt_br: Cliente desktop para Nextcloud

source: Desktop music player using free sources
pt_br: Tocador de música que usa fontes grátis/livres

source: OnlyOffice Desktop
pt_br: OnlyOffice para Desktop

source: Comic and PDF viewer
pt_br: Visualizador de PDF e quadrinhos

source: Docker Kubernetes manager
pt_br: Gerenciador de Kubernates (docker)

source: Secure communication for everyone
pt_br: Comunicação segura para todos

source: Multi-account Mastodon/Pleroma client
pt_br: Cliente multi-conta Mastodon/Pleroma

source: Documentation generator for bash
pt_br: Gerador de documentação para bash

source: Document viewer for different formats
pt_br: Visualizador de documentos

source: xUnit based unit test for bash scripts
pt_br: Teste de unidade para scripts shell baseado em xUnit

source: Decentralized and secure messenger
pt_br: Mensageiro descentralizado e seguro

source: Mastodon client for PC
pt_br: Cliente Mastodon para PC

source: A new Bootable USB Solution
pt_br: Uma nova solução para USB bootável

source: Editor for programmer
pt_br: Editor para programadores

source: Federated microblog client
pt_br: Cliente para microblog federado

source: Markdown editor for the 21st century
pt_br: Um editor Markdown para o século 21
