Repository: carlisson/nh1
Catalog: lib/locale/*.po
Languages: pt_br

source: NH1 config file has changed. Reload nh1?
pt_br: Arquivo de configuração do NH1 mudou. Recarregar nh1?

source: Creating database file for %s.
pt_br: Gerando arquivo de banco para %s

source: Database %s exists.
pt_br: Banco %s existe.

source: Excluding database file for %s.
pt_br: Excluindo arquivo de banco para %s.

source: Database %s does not exist.
pt_br: Banco %s não existe.

source: Variable %s not found in database %s.
pt_br: Variável %s não encontrada no banco %s.

source: Database %s not found.
pt_br: Banco %s não encontrado.

source: Listing content for %s database.
pt_br: Listando o conteúdo para o banco %s.

source: You need to give status, command name, message and dependencies
pt_br: Você precisa passar status, nome do comando, mensagem e dependências

source: This command needs sudo: %s
pt_br: Este comando precisa de sudo: %s

source: NH1 is already installed in your profile. Run NH1 to see all commands available.
pt_br: NH1 está instalado no seu perfil. Rode NH1 para ver todos os comandos disponíveis

source: Installing NH1 in %s...
pt_br: Instalando NH1 em %s...

source: Done!
pt_br: Feito!

source: Usage: 1banner [%s] [%s].
pt_br: Uso: 1banner [%s] [%s].

source: size
pt_br: tamanho

source: text
pt_br: texto

source: Usage:
pt_br: Uso:

source: Build documentation for NH1
pt_br: Gerar arquivos de documenação para o NH1

source: project name
pt_br: nome do projeto

source: doc directory
pt_br: diretório da documentação

source: source-code files
pt_br: arquivos-fonte

source: %s is missing for %s
pt_br: %s está faltando para %s

source: Program %s does not exist or it is unavailable for %s.
pt_br: O programa %s não existe ou está indisponível para %s.

source: Destroying all variables...
pt_br: Destruindo todas as variáveis...

source: Internal databases:%s.
pt_br: Bancos internos:%s.

source: list all databases.
pt_br: Lista todos os bancos disponíveis

source: name
pt_br: nome

source: creates a new database.
pt_br: cria um novo banco.

source: removes the database.
pt_br: remove o banco.

source: database name
pt_br: nome do banco

source: variable name
pt_br: nome da variável

source: variable value
pt_br: valor da variável

source: mode
pt_br: modo

source: Mode: %s or %s. Default: %s.
pt_br: Modo: %s ou %s. Default: %s.

source: Special
pt_br: Especial

source: Main
pt_br: Sessão Principal

source: Prints a header inside a banner.
pt_br: Imprime um cabeçalho dentro de um banner.

source: Modify .bashrc to NH1 starts on bash start
pt_br: Modifica .bashrc para o NH1 iniciar com o bash

source: Build documentation files for NH1
pt_br: Gerar arquivos de documenação para o NH1

source: Clean NH1 from memory (undo NH1 charge)
pt_br: Limpa NH1 da memória (desfaz as mudanças do NH1)

source: List, create or delete a internal key-value DB.
pt_br: Lista, cria ou remove um banco chave-valor interno.

source: Get a value from a DB variable.
pt_br: Recupera o valor de uma variável do banco.

source: Set in DB a value for a variable.
pt_br: Define no banco um valor para uma variável.

source: List all variables in a DB.
pt_br: Lista todas as variáveis em um banco.

source: List possible custom variables
pt_br: Lista possíveis variáveis custom

source: Write a string in another color
pt_br: Escreve um texto em outra cor

source: Write a string with background color
pt_br: Escreve um texto com cor de fundo

source: Create and apply translation for NH1.
pt_br: Cria e aplica tradução para NH1.

source: Update your NH1, using git
pt_br: Atualiza seu NH1, usando git

source: Enable/disable verbose mode
pt_br: Habilita/desabilita o modo verboso

source: List NH1 version and latest changes/updates
pt_br: Lista a versão do NH1 e as últimas mudanças/atualizações

source: planning
pt_br: planejamento

source: working
pt_br: funcional

source: deprecated
pt_br: obsoleto

source: Power-up your shell
pt_br: Dê poderes ao seu shell

source: After destroy variables, I will load %s.
pt_br: Depois de destruir as variáveis, eu carregarei %s.

source: You need to put a string and a color number (optional)
pt_br: Você precisa passar um texto e um número de cor (opcional)

source: black
pt_br: preto

source: red
pt_br: vermelho

source: green
pt_br: verde

source: yellow
pt_br: amarelo

source: blue
pt_br: azul

source: cyan
pt_br: ciano

source: white
pt_br: branco

source: Usage (for NH1): 1translate [%s] [%s].
pt_br: Uso (para NH1): 1translate [%s] [%s].

source: language code
pt_br: código do idioma

source: build (optional)
pt_br: gerar (opcional)

source: Usage (generic): 1translate [%s] [%s] [%s] [%s].
pt_br: Uso (genérico): 1translate [%s] [%s] [%s] [%s].

source: locales path
pt_br: caminho locales

source: domain name
pt_br: nome de domínio

source: Steps to translate NH1
pt_br: Passos para traduzir o NH1

source: Run 1translate <language-code>. For example, 1translate pt_BR
pt_br: Rode 1translate <código-do-idioma>. Por exemplo, 1translate pt_BR

source: Edit the file <language-code>.po in %s, puting the translated strings
pt_br: Edite o arquivo <código-do-idioma>.po em %s, colocando os textos traduzidos

source: Run 1translate <language-code> build. This will generate .mo file. "build" can be replaced to anything
pt_br: Rode 1translate <código-do-idioma> gen. Isso vai gerar o arquivo .mo. "gen" pode ser substituído por qualquer coisa

source: Enjoy NH1 in your language! It's useful if you return translated .po to improve NH1 project!
pt_br: Aproveite NH1 no seu idioma! Considere retornar o .po traduzido para melhorar o projeto NH1!

source: Steps to translate generic shellscript
pt_br: Passos para traduzir um shellscript genérico

source: Run 1translate <locale-path> <domain-name> <language-code> <files>. For example, 1translate ./ hello pt_BR *.sh
pt_br: Rode 1translate <caminho-locale> <nome-de-domínio> <código-do-idioma> <arquivos>. Por exemplo, 1translate ./ hello pt_BR *.sh

source: Edit the file <language-code>.po in locales/, puting the translated strings
pt_br: Edite o arquivo <código-do-idioma>.po em locales/, colocando os textos traduzidos

source: Run 1translate <locale-path> <domain-name> <language-code>. This will generate .mo file.
pt_br: Rode 1translate <caminho-locale> <nome-de-domínio> <código-do-idioma>. Isso vai gerar o arquivo .mo

source: Enjoy your shellscript in your language!
pt_br: Aproveite o seu shellscript no seu idioma!

source: NH1 was in version %s.
pt_br: NH1 estava na versão %s.

source: You are using NH1 from tar-ball, not from Git.
pt_br: Você está usando NH1 a partir do tar-ball, não do Git.

source: Git program is not available.
pt_br: Programa git não está disponível.

source: Verbose mode is on
pt_br: Modo verboso está ligado

source: Verbose mode is off
pt_br: Modo verboso está desligado

source: Building documentation for %s...
pt_br: Gerando documentação para %s...

source: Building documentation for nh1 %s...
pt_br: Gerando documentação para %s do nh1...

source: main file
pt_br: Arquivo principal

source: module files
pt_br: arquivos de módulo

source: Documentation available in %s.
pt_br: Documentação está disponível em %s.

source: Custom variables
pt_br: Variáveis Custom

source: You can configure custom variables for NH1. Edit %s to define it.
pt_br: Você pode configurar variáveis custom para o NH1. Edite %s para definí-las.

source: Path to internal key-value databases
pt_br: Caminho para os bancos chave-valor internos

source: Show notification on desktop. Default: false
pt_br: Mostra notificação no desktop. Default: false

source: Set verbose mode. Default: false
pt_br: Define o modo verboso. Default: false

source: Custom variables (in use)
pt_br: Variáveis Custom (em uso)

source: Running for %s
pt_br: Rodando para %s

source: Done. %i modules not ready for this command.
pt_br: Feito. %i módulos não estavam prontos para este comando.

source: Generating translation file.
pt_br: Gerando arquivo de tradução.

source: .pot file generated. Trying to create/update .po
pt_br: Arquivo .pot gerado. Tentando criar/atualizar .po

source: Generating .mo file for %s language
pt_br: Gerando arquivo .mo para o idioma %s

source: You need run: source %s.
pt_br: Você precisa rodar: source %s.

source: Angel template system
pt_br: Sistema de templates Angel

source: Usage: %s [%s] [%s] [%s]* > [%s]
pt_br: Uso: %s [%s] [%s]* [%s] > [%s]

source: Command
pt_br: Comando

source: angel input file
pt_br: arquivo de entrada angel

source: Attributions (var=value)
pt_br: Atribuições (var=value)

source: output file
pt_br: arquivo de saída

source: show this help
pt_br: mostra esta ajuda

source: apply a template
pt_br: aplicar um template

source: show template content
pt_br: mostra conteúdo do template

source: test arguments
pt_br: testa parâmetros

source: Error in %s
pt_br: Erro em %s

source: File: %s for name %s
pt_br: Arquivo: %s para o nome %s

source: Showing template information
pt_br: Mostrando informações do template

source: Includes variable: %s
pt_br: Inclui a variável: %s

source: using variable %s to get the included angel file
pt_br: usando variável %s para obter o arquivo angel a ser incluído

source: using this angel file: %s
pt_br: usando este arquivo angel: %s

source: Varibale %s with default value %s
pt_br: Variável %s com valor padrão %s

source: Varibale %s without default value
pt_br: Variável %s sem valor padrão

source: Install App
pt_br: Aplicativos AppImage

source: List all available apps
pt_br: Lista todos os aplicativos disponíveis

source: Install or update an app locally
pt_br: Instala ou atualiza um aplicativo localmente

source: Install or update an app globaly
pt_br: Instala ou atualiza um aplicativo globalmente

source: Install or update a package (using OS)
pt_br: Instala ou atualiza um pacote (usando o SO)

source: Update all local apps
pt_br: Atualiza todos os aplicativos locais

source: Update all global apps
pt_br: Atualiza todos os aplicativos globais

source: Upgrade all packages(using OS)
pt_br: Atualiza todos os pacotes (usando o SO)

source: Remove a local app
pt_br: Remove um aplicativo local

source: Remove a global app
pt_br: Remove um aplicativo global

source: Remove old versions for a local app (or all)
pt_br: Remove versões antigas de um aplicativo (ou de todos)

source: Remove old versions for a global app (or all)
pt_br: Remove versões antigas de um aplicativo global (ou de todos)

source: Remove old versions for all system apps
pt_br: Remove versões antigas de todos os apps do sistema

source: Helps to create regular expression to make a recipe
pt_br: Ajuda a criar a expressão regular para fazer uma receita

source: Retains old app files? (1 or 0). Default: 0
pt_br: Reter arquivos antigos de app? (1 ou 0). Default: 0

source: No prefix defined for %s app!
pt_br: Nenhum prefixo definido para o app %s!

source: Creating desktop file for %s.
pt_br: Gerando arquivo desktop para %s

source: No PNG for app. No desktop file created.
pt_br: PNG não encontrado para o app. Arquivo desktop não criado.

source: Removing old app version %s.
pt_br: Removendo app na versão antiga %s.

source: App needs %s and it's not available.
pt_br: Programa precisa de %s, que não está(ão) disponível(is).

source: Git install/update for %s
pt_br: Instalação/atualização git para %s

source: Wrong app type.
pt_br: Tipo de aplicativo errado.

source: %s is already up to date.
pt_br: %s já está atualizado.

source: To install/upgrade:
pt_br: Prestes a instalar/atualizar:

source: Error geting %s file name. Check the recipe or try again later.
pt_br: Erro ao buscar o nome de arquivo %s. Cheque a receita ou tente de novo mais tarde.

source: %s not found.
pt_br: %s não encontrado.

source: Type unsuported: %s.
pt_br: Tipo não suportado: %s.

source: Unknown app: %s.
pt_br: Aplicativo desconhecido: %s.

source: App %s removed with file %s
pt_br: Aplicativo %s removido com o arquivo %s

source: 1app status
pt_br: Status do 1App

source: App
pt_br: Aplicativo

source: Description
pt_br: Descrição

source: Installation
pt_br: Instalação

source: system
pt_br: sistema

source: None
pt_br: Nada

source: Use %s to usage instructions.
pt_br: Use %s para instruções de uso.

source: Searching %s in %s...
pt_br: Buscando %s em %s...

source: Package %s found in %s.
pt_br: Pacote %s encontrado em %s.

source: Package %s not found in %s.
pt_br: O pacote %s não foi encontrado em %s.

source: The search returned more than one result!
pt_br: A busca retornou mais de um resultado!

source: Sorry. Package %s not found in known/installed package managers.
pt_br: Lamento. O pacote %s não foi encontrado nos gerenciadores de pacotes conhecidos/instalados.

source: Upgrading %s...
pt_br: Atualizando %s...

source: App not found.
pt_br: Aplicativo não encontrado.

source: Cleaning %s...
pt_br: Limpando %s...

source: Usage: %s [%s] [%s] [%s]
pt_br: Uso: %s [%s] [%s] [%s]

source: command
pt_br: comando

source: scope
pt_br: escopo

source: option
pt_br: opção

source: Commands
pt_br: Comandos

source: list all available commands
pt_br: Lista de todos os comandos disponíveis

source: install/update an application
pt_br: Instala ou atualiza um aplicativo

source: uninstall an application
pt_br: desinstala um aplicativo

source: Update all installed packages
pt_br: Atualiza todos os pacotes instalados

source: Remove old files and caches
pt_br: Remove arquivos e caches antigos.

source: show this usage instructions
pt_br: mostra essas instruções de uso

source: Scopes
pt_br: Escopos

source: installed in user space
pt_br: instalados no espaço do usuário

source: installed for all users, with binaries in %s
pt_br: instalados para todos os usuários, com binários em %s

source: installed with system package managers (apt, dnf, snap, etc)
pt_br: instalados com os gerenciadores de pacotes do sistema (apt, dnf, snap, etc)

source: all installations: local, global and system
pt_br: todas as instalações: local, global e system

source: Updating %s applications.
pt_br: Atualizando aplicativos do escopo %s.

source: It works.
pt_br: Funcionou.

source: String not found in URL page.
pt_br: Texto não encontrado na página da URL.

source: Audio
pt_br: Áudio

source: Play an audio alarm
pt_br: Toca um alarme sonoro

source: Play a simple beat in given frequency
pt_br: Toca um som simples em uma dada frequência

source: Append various MP3 files in one single file
pt_br: Junta vários arquivos MP3 em um único arquivo

source: Extract metadata from an MP3 to a TXT
pt_br: Extrai metadados de um arquivo MP3 para TXT

source: Create a new MP3 file applying metadata from a TXT
pt_br: Cria um novo arquivo MP3 aplicando metadados de um TXT

source: Convert a ogg file to mp3
pt_br: Converte um arquivo ogg para mp3

source: Create static video from MP3 and PNG
pt_br: Cria um vídeo estático a partir de um MP3 e um PNG

source: Convert Portuguese text to WAV
pt_br: Converte textos em Português para WAV

source: Extract Youtube video to MP3
pt_br: Extrai vídeo do Youtube para MP3

source: Usage: %s <%s>
pt_br: Uso: %s <%s>

source: audio frequency (int)
pt_br: frequência do som (inteiro)

source: Usage: %s <%s> <%s>
pt_br: Uso: %s <%s> <%s>

source: directory with input mp3 files
pt_br: diretório com os arquivos mp3 de entrada

source: output mp3 file
pt_br: Arquivo mp3 de saída

source: MP3 input file
pt_br: Arquivo de entrada MP3

source: Text output file
pt_br: Arquivo de texto de saída

source: Usage: %s <%s> <%s> [%s]
pt_br: Uso: %s <%s> <%s> [%s]

source: TXT metadata input file
pt_br: Arquivo de entrada com metadados em TXT

source: (optional) MP3 output file
pt_br: (Opcional) arquivo de entrada MP3

source: Default output file: %s
pt_br: Arquivo de saída por omissão: %s

source: Usage: %s <%s> [(%s) %s]
pt_br: Uso: %s <%s> [(%s) %s]

source: input ogg file
pt_br: Arquivo de entrada ogg

source: optional
pt_br: opcional

source: Usage: %s <%s> <%s> <%s>
pt_br: Uso: %s <%s> <%s> <%s>

source: input mp3 file
pt_br: Arquivo mp3 de entrada

source: input png file
pt_br: Arquivo png de entrada

source: output mp4 file
pt_br: Arquivo mp4 de saída

source: Message
pt_br: Mensagem

source: output wave file
pt_br: Arquivo wave de saída

source: Youtube video URL
pt_br: URL de vídeo do Youtube

source: Usage: %s.
pt_br: Uso: %s.

source: Downloading %s to file %s.
pt_br: Baixando %s para arquivo %s

source: Local file: %s.
pt_br: Arquivo local: %s.

source: Backup tools
pt_br: Ferramentas de backup

source: Make backup of a dir
pt_br: Faz backup de um diretório

source: Restore a backup
pt_br: Restaura um backup

source: List saved backups
pt_br: Lista backups salvos

source: Enabling completion for 1backup.
pt_br: Habilitando completar para 1backup.

source: Path for backups.
pt_br: Caminho para os backup.

source: Max quantity of files to keep for each backup.
pt_br: Quantidade máxima de arquivos a manter para cada backup.

source: Group backups by: day (%s), weekly (%s), month (%s), year (%s) or no-group (%s).
pt_br: Agrupar backups por: dia (%s), semana (%s), mês (%s), ano (%s) ou não agrupar (%s).

source: There are %i backups. Max is %i. Removing %s.
pt_br: Há %i backups. Máximo é %i. Removendo %s.

source: Removed file %s from %s.
pt_br: Removido arquivo %s de %s.

source: ERROR removing %s from %s... %i
pt_br: ERRO removendo %s de %s... %i

source: Backup id %s not recognized.
pt_br: ID de Backup %s não reconhecido.

source: Name: backup id
pt_br: Nome: id do backup

source: Directory: target to backup
pt_br: Diretório: alvo para o backup

source: Backups are saved in %s
pt_br: Backups são salvos em %s

source: Running %s for %s, saving in %s...
pt_br: Rodando %s para %s, salvando em %s...

source: ERROR
pt_br: ERRO

source: tar with xz
pt_br: tar com xz

source: tar with bzip2
pt_br: tar com bzip2

source: tar with gzip
pt_br: tar com gzip

source: Running tar without compression! Install gzip, bzip2 or xz!
pt_br: Rodando tar sem compressão! Instale gzip, bzip2 ou xz!

source: tar without compression
pt_br: tar sem compressão

source: No compressor found. Try to install 7zip, zip or tar (with gzip, bzip2 or xz).
pt_br: Nenhum compactador encontrado. Tente instalar 7zip, zip ou tar (comgzip, bzip2 ou xz).

source: Bot system to send messages
pt_br: Sistema de bot para enviar mensagens

source: Token for Telegram bot. Get it from @BotFather
pt_br: Token para o bot do Telegram. Crie com o @BotFather

source: Login and password for Nextcloud bot. In format server|login|password
pt_br: Login e senha para o bot do Nextcloud. No formato servidor|login|senha

source: Usage: %s %s [%s] [%s]
pt_br: Uso: %s %s [%s] [%s]

source: type
pt_br: tipo

source: Other options
pt_br: Outras opções

source: works as a Telegram bot
pt_br: trabalha como um bot do Telegram

source: works as a Nextcloud talk bot
pt_br: trabalha como um bot do Nextcloud

source: Path to remote file
pt_br: caminho para o arquivo remoto

source: Get a file from server
pt_br: Pega um arquivo do servidor

source: list new groups for telegram bot
pt_br: lista novos grupos para o bot do telegram

source: Group name
pt_br: nome do grupo

source: Group ID
pt_br: ID do grupo

source: Save a group
pt_br: Salve um grupo

source: Delete a group
pt_br: Delete um grupo

source: Remote directory
pt_br: Diretório remoto

source: Local file
pt_br: Arquivo local

source: Puts a file
pt_br: Coloca um arquivo

source: message
pt_br: mensagem

source: Send a message
pt_br: Envia uma mensagem

source: path to file
pt_br: caminho para o arquivo

source: Send a file
pt_br: Envia um arquivo

source: %s for %s is missing!
pt_br: %s está faltando para %s!

source: New groups
pt_br: Novos grupos

source: New group found: %s (name: %s)
pt_br: Novo grupo encontrado: %s (nome: %s)

source: Sending %s "%s" to %s group via %s
pt_br: Enviando %s "%s" para o grupo %s via %s

source: file
pt_br: arquivo

source: File %s not found
pt_br: Arquivo %s não encontrado.

source: Putting %s "%s" into %s directory on %s
pt_br: Enviando %s "%s" para o diretório %s via %s

source: Canva Section
pt_br: Sessão Canva

source: List all templates or help for given template
pt_br: Lista todos os templates ou ajuda a usar um template

source: Generate image from template
pt_br: Gera imagem a partir de um template

source: Install or update a template
pt_br: Instala ou atualiza um template

source: Remove installed template
pt_br: Remove um template instalado

source: Generates image from template
pt_br: Gera imagem a partir de um template

source: Path for 1canva and 1token internal templates.
pt_br: Caminho para os templates internos do 1canva e do 1token.

source: Size for 1token images (it will be generated as squares sizexsize).
pt_br: Tamanho para imagens do 1token (serão geradas como quadrados tamanhoXtamanho).

source: Help for template: %s.
pt_br: Ajuda para o template: %s.

source: No template found.
pt_br: Nenhum template encontrado.

source: Usages:
pt_br: Usos:

source: Template %s not found.
pt_br: Template %s não encontrado.

source: Cron Section
pt_br: Sessão do Cron

source: Set a cron entry
pt_br: Define uma entrada no cron

source: Remove a cron entry
pt_br: Remove uma entrada do cron

source: List all cron entries
pt_br: Lista todas as entradas do cron

source: Check and run due commands
pt_br: Checa e executa os devidos comandos

source: Run cron in daemon mode
pt_br: Roda o cron em modo daemon

source: Run a command every x seconds, minutes or hours
pt_br: Roda um comando a cada x segundos, minutos ou horas

source: Run a command now
pt_br: Roda um comando agora

source: Enabling complete for cron module.
pt_br: Habilitando completar para o módulo cron.

source: Path for cron rules
pt_br: Caminho para as regras do cron

source: Turn on (true) or off (false) cron checkings
pt_br: Liga (true) ou desliga (false) as checagens do cron

source: Command %s finished at %s.
pt_br: Comando %s finalizado em %s.

source: Usage: %s [%s] <%s> <%s>
pt_br: Uso: %s [%s] <%s> <%s>

source: (optional) "quiet" for quiet mode
pt_br: (opcional) "quiet" para modo silencioso

source: Interval
pt_br: Intervalo

source: Command ID
pt_br: ID do Comando

source: Finishing command %s.
pt_br: Encerrado o comando %s.

source: Command %s executed at %s. Running now (%s) again. %i
pt_br: Comando %s executado em %s. Rodando agora (%s) novamente. %i

source: Command %s is still running (PID %i).
pt_br: Comando %s ainda rodando (PID %i).

source: Command %s is not more running.
pt_br: Comando %s não está mais rodando.

source: Run (frequency: %s) the command %s.
pt_br: Rodar (frequência: %s) o comando %s.

source: Unknown cron time
pt_br: Tempo de cron desconhecido

source: Usage: %s [%s] [%s] [%s].
pt_br: Uso: %s [%s] [%s] [%s].

source: cron time
pt_br: tempo do cron

source: command id
pt_br: id do comando

source: Time values:
pt_br: Valores de tempo:

source: Unknown cron time.
pt_br: Tempo de cron desconhecido.

source: Usage: %s [%s] [%s].
pt_br: Uso: %s [%s] [%s].

source: Command not found
pt_br: Comando não encontrado

source: cron time (optional)
pt_br: tempo do cron (opcional)

source: Starting cron function.
pt_br: Iniciando a função cron.

source: Cron finished.
pt_br: Cron concluído.

source: Miscelania
pt_br: Miscelânia

source: Join an array, using first param as delimiter
pt_br: Junta um array, usando o primeiro parâmetro como separador

source: Generate a seq for booklet, for given page number
pt_br: Gera sequência para livreto, dado número de páginas

source: Generate a random hexadecimal color
pt_br: Gera uma cor hexadecimal aleatória

source: Generate a random diceware password
pt_br: Gera uma senha segura diceware

source: Disk usage
pt_br: Uso do disco

source: Short diceware/dwd12 password
pt_br: Senha curta diceware/dwd12

source: Calculates how much time has passed
pt_br: Calcula quanto tempo passou

source: Rename a file or dir, excluding special chars
pt_br: Renomeia um arquivo ou diretório, excluindo caracteres especiais
